{"id_bloco":"clima_heat_index_01","titulo":"Heat Index - Conceito Geral","fonte":"NOAA National Weather Service - Heat Index Chart (2015)","tipo":"conforto_termico","tags":["heat_index","sensacao_termica","temperatura","umidade"],"teoria_base":"O Heat Index estima a sensação térmica percebida pelo corpo humano combinando temperatura e umidade relativa. Quanto maior a umidade, menor a capacidade do corpo de perder calor através do suor, elevando a sensação térmica.","bloco_resumido":"O Heat Index combina temperatura e umidade e reflete como o corpo realmente sente o calor. Altos valores indicam risco de estresse térmico.","embedding_text":"O Heat Index é um índice desenvolvido pela NOAA que representa a sensação térmica percebida pelo corpo humano considerando temperatura do ar e umidade relativa. Com alta umidade, a capacidade de resfriamento do corpo por evaporação do suor diminui, fazendo com que a sensação de calor seja muito maior que a temperatura medida. O Heat Index define faixas de risco, como: sensação de calor forte, perigo e extremo perigo, associadas à possibilidade de exaustão, desidratação e insolação.","exemplos_praticos":["Temperatura de 32°C com 70% de umidade gera sensação de ~41°C.","Acima de Heat Index 40, cresce o risco de exaustão por calor."]}
{"id_bloco":"clima_heat_index_02","titulo":"Heat Index - Faixas de Risco","fonte":"NOAA Heat Safety Tool","tipo":"conforto_termico","tags":["heat_index","classificacao","risco","calor_extremo"],"teoria_base":"Faixas de Heat Index são usadas mundialmente para identificar riscos à saúde durante calor intenso.","bloco_resumido":"Define categorias como perigo, extremo perigo e desconforto moderado.","embedding_text":"As faixas de classificação do Heat Index são: de 27°C a 32°C caracteriza desconforto leve a moderado; entre 33°C e 40°C, risco de exaustão por calor aumenta; entre 41°C e 53°C, situação de perigo com possibilidade real de esgotamento e insolação; acima de 54°C, considerado extremo perigo, podendo ocorrer colapso térmico rapidamente. Essas categorias ajudam a interpretar dados de temperatura e umidade para gerar alertas mais precisos.","exemplos_praticos":["Heat Index 44 indica perigo alto para atividades ao ar livre.","Heat Index 51 é classificado como extremo perigo."]}
{"id_bloco":"clima_humidex_01","titulo":"Humidex - Indicador de Desconforto Térmico","fonte":"Environment Canada - Humidex Guide","tipo":"conforto_termico","tags":["humidex","calor","desconforto_termico"],"teoria_base":"O Humidex usa temperatura e conteúdo de vapor no ar para estimar desconforto térmico humano.","bloco_resumido":"Quanto maior o vapor d’água no ar, maior a sensação de calor.","embedding_text":"O Humidex é um índice canadense que combina temperatura e quantidade de vapor d’água para representar o desconforto térmico. Ele considera a influência da umidade absoluta, não apenas a relativa, tornando-o útil em regiões úmidas. Faixas comuns: até 29 é confortável; 30 a 39 gera desconforto; 40 a 45 é perigoso; acima de 45, risco de insolação é elevado.","exemplos_praticos":["28°C com ar muito úmido pode gerar Humidex 38.","Humidex acima de 40 indica risco de estresse térmico."]}
{"id_bloco":"clima_utci_01","titulo":"UTCI - Índice Universal de Clima Térmico","fonte":"UTCI Consortium - Operational Procedure","tipo":"conforto_termico","tags":["utci","estresse_termico","conforto_termico"],"teoria_base":"UTCI integra temperatura, vento, umidade e radiação solar em um índice de estresse térmico.","bloco_resumido":"É o índice mais completo para avaliar conforto térmico ao ar livre.","embedding_text":"O UTCI é um índice de estresse térmico usado internacionalmente. Ele considera múltiplos fatores: temperatura do ar, velocidade do vento, umidade relativa e radiação solar. Classificações incluem desde estresse térmico leve até estresse térmico extremo, tanto para calor quanto para frio. Ele é amplamente usado em planejamento urbano, saúde pública e análise de ambientes externos.","exemplos_praticos":["UTCI acima de 38 indica forte estresse térmico por calor.","UTCI abaixo de -13 indica estresse térmico severo por frio."]}
{"id_bloco":"clima_chuva_01","titulo":"Probabilidade de Precipitação (PoP) - Interpretação Correta","fonte":"NOAA - Understanding Probability of Precipitation","tipo":"chuva","tags":["pop","chuva","precipitacao","probabilidade"],"teoria_base":"PoP representa a probabilidade de chuva em uma área, não quantidade de chuva.","bloco_resumido":"PoP = confiança do meteorologista x cobertura provável da área.","embedding_text":"Probabilidade de Precipitação (PoP) representa a chance de ocorrer precipitação mensurável na área considerada. Não significa que choverá durante todo o período, nem que choverá em toda a cidade. PoP é calculado como confiança do meteorologista multiplicada pela porcentagem da área com condições favoráveis. Ex.: 60% PoP pode significar grande confiança de chuva isolada ou baixa confiança de chuva generalizada.","exemplos_praticos":["PoP 40% indica instabilidade, mas não garantia de chuva.","PoP 80% geralmente indica chuva ou trovoada no período."]}
{"id_bloco":"clima_chuva_02","titulo":"Classificação de Intensidade de Chuva","fonte":"NOAA Rainfall Intensity Table","tipo":"chuva","tags":["chuva","intensidade","classificacao"],"teoria_base":"Chuva pode ser classificada por taxa de precipitação em mm/h.","bloco_resumido":"Chuva leve, moderada, forte e muito forte com base em mm/h.","embedding_text":"A intensidade da chuva é frequentemente classificada assim: chuva leve até 2 mm/h; moderada entre 2 e 10 mm/h; forte entre 10 e 50 mm/h; muito forte acima de 50 mm/h, com potencial para alagamentos rápidos. Essa classificação é usada para interpretar riscos e orientar alertas.","exemplos_praticos":["Chuva de 12 mm/h = chuva forte.","Acima de 50 mm/h indica potencial de tempestade."]}
{"id_bloco":"clima_vento_01","titulo":"Wind Chill - Sensação de Frio com Vento","fonte":"NOAA Wind Chill Index","tipo":"vento","tags":["wind_chill","frio","vento"],"teoria_base":"O vento acelera a perda de calor corporal, aumentando sensação de frio.","bloco_resumido":"Wind Chill indica o quanto o corpo sente de frio, considerando vento + temperatura.","embedding_text":"O índice de Wind Chill mede a sensação térmica em ambientes frios com vento. O movimento do ar remove calor do corpo de forma mais rápida, podendo gerar risco de hipotermia mesmo com temperaturas moderadas. Valores baixos indicam estresse térmico e risco aumentado para pele exposta.","exemplos_praticos":["Com 5°C e vento de 30 km/h, a sensação pode ser de -5°C.","Wind Chill abaixo de -20 representa alto risco de congelamento."]}
{"id_bloco":"clima_saude_01","titulo":"Ondas de Calor e Saúde","fonte":"WHO - Heatwaves and Health (2015)","tipo":"saude","tags":["heatwave","saude","calor_extremo"],"teoria_base":"Ondas de calor são eventos perigosos com alto risco à saúde.","bloco_resumido":"Calor extremo aumenta risco de desidratação, exaustão e insolação.","embedding_text":"Ondas de calor são períodos prolongados de temperaturas anormalmente altas que apresentam riscos significativos à saúde humana. A OMS destaca que calor extremo aumenta incidência de desidratação, exaustão térmica, insolação e mortalidade em grupos vulneráveis, como idosos, crianças e pessoas com doenças crônicas.","exemplos_praticos":["Temperaturas elevadas por vários dias aumentam a sobrecarga térmica.","Risco maior para bebês, idosos e pessoas com doenças cardíacas."]}
{"id_bloco":"clima_tendencias_01","titulo":"Tendências e Análise Temporal de Clima","fonte":"Time Series Analysis - Shumway & Stoffer","tipo":"tendencia","tags":["tendencia","series_temporais","estatistica"],"teoria_base":"Conceitos básicos para avaliar padrões em dados de clima.","bloco_resumido":"Tendências, médias móveis e anomalias ajudam a interpretar dados históricos.","embedding_text":"Em séries temporais climáticas, conceitos como tendência, média móvel, variação e anomalia são essenciais. Tendência indica aumento ou diminuição persistente ao longo do tempo; médias móveis suavizam variações; anomalias representam desvios da média normal. Esses conceitos permitem avaliar se a temperatura está subindo, estabilizando ou caindo ao longo dos dias.","exemplos_praticos":["Temperatura subindo 1°C por dia indica tendência de aquecimento.","Desvio de +3°C acima da média semanal é uma anomalia de calor."]}
